Sure, basically I have the following nodes
```bash
kubectl get nodes -o json | jq '.items[].spec.taints'
[
  {
    "effect": "NoExecute",
    "key": "CriticalAddonsOnly",
    "value": "true"
  }
]
[
  {
    "effect": "NoExecute",
    "key": "Vault",
    "value": "true"
  }
]
[
  {
    "effect": "NoExecute",
    "key": "Vault",
    "value": "true"
  }
]
[
  {
    "effect": "NoExecute",
    "key": "Vault",
    "value": "true"
  }
]
[
  {
    "effect": "NoExecute",
    "key": "CriticalAddonsOnly",
    "value": "true"
  }
]
[
  {
    "effect": "NoExecute",
    "key": "Vault",
    "value": "true"
  }
]
[
  {
    "effect": "NoExecute",
    "key": "Vault",
    "value": "true"
  }
]
```

I'm trying to deploy `nginx-ingress-controller` using terraform with 
```bash
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "admissionWebhooks":
                    "path":
                      "tolerations":
                      - "effect": "NoExecute"
                        "key": "CriticalAddonsOnly"
                        "operator": "Equal"
                        "value": "true"
                  "service":
                    "internal":
                      "annotations":
                        "external-dns.alpha.kubernetes.io/hostname": "vault.internal.services.local."
                        "service.beta.kubernetes.io/aws-load-balancer-scheme": "internal"
                      "enabled": true
                  "tolerations":
                  - "effect": "NoExecute"
                    "key": "CriticalAddonsOnly"
                    "operator": "Equal"
                    "value": "true"
            EOT,
        ]
      + verify                     = false
      + version                    = "4.11.2"
      + wait                       = true
      + wait_for_jobs              = false
    }
```

But apparently , this pod is stuck in pending state due lack of the proper tolerations
```bash
kubectl get po ingress-nginx-admission-create-g65dk  -n kube-system -oyaml
apiVersion: v1
kind: Pod
metadata:
  creationTimestamp: "2024-09-17T15:46:41Z"
  finalizers:
  - batch.kubernetes.io/job-tracking
  generateName: ingress-nginx-admission-create-
  labels:
    app.kubernetes.io/component: admission-webhook
    app.kubernetes.io/instance: ingress-nginx
    app.kubernetes.io/managed-by: Helm
    app.kubernetes.io/name: ingress-nginx
    app.kubernetes.io/part-of: ingress-nginx
    app.kubernetes.io/version: 1.11.2
    batch.kubernetes.io/controller-uid: 368c9af7-74c2-43ed-bebe-1330824a808f
    batch.kubernetes.io/job-name: ingress-nginx-admission-create
    controller-uid: 368c9af7-74c2-43ed-bebe-1330824a808f
    helm.sh/chart: ingress-nginx-4.11.2
    job-name: ingress-nginx-admission-create
  name: ingress-nginx-admission-create-g65dk
  namespace: kube-system
  ownerReferences:
  - apiVersion: batch/v1
    blockOwnerDeletion: true
    controller: true
    kind: Job
    name: ingress-nginx-admission-create
    uid: 368c9af7-74c2-43ed-bebe-1330824a808f
  resourceVersion: "2429971"
  uid: ee543802-aff9-45a7-a1d4-ea7c918294cf
spec:
  containers:
  - args:
    - create
    - --host=ingress-nginx-controller-admission,ingress-nginx-controller-admission.$(POD_NAMESPACE).svc
    - --namespace=$(POD_NAMESPACE)
    - --secret-name=ingress-nginx-admission
    env:
    - name: POD_NAMESPACE
      valueFrom:
        fieldRef:
          apiVersion: v1
          fieldPath: metadata.namespace
    image: registry.k8s.io/ingress-nginx/kube-webhook-certgen:v1.4.3@sha256:a320a50cc91bd15fd2d6fa6de58bd98c1bd64b9a6f926ce23a600d87043455a3
    imagePullPolicy: IfNotPresent
    name: create
    resources: {}
    securityContext:
      allowPrivilegeEscalation: false
      capabilities:
        drop:
        - ALL
      readOnlyRootFilesystem: true
      runAsNonRoot: true
      runAsUser: 65532
      seccompProfile:
        type: RuntimeDefault
    terminationMessagePath: /dev/termination-log
    terminationMessagePolicy: File
    volumeMounts:
    - mountPath: /var/run/secrets/kubernetes.io/serviceaccount
      name: kube-api-access-hr782
      readOnly: true
  dnsPolicy: ClusterFirst
  enableServiceLinks: true
  nodeSelector:
    kubernetes.io/os: linux
  preemptionPolicy: PreemptLowerPriority
  priority: 0
  restartPolicy: OnFailure
  schedulerName: default-scheduler
  securityContext: {}
  serviceAccount: ingress-nginx-admission
  serviceAccountName: ingress-nginx-admission
  terminationGracePeriodSeconds: 30
  tolerations:
  - effect: NoExecute
    key: node.kubernetes.io/not-ready
    operator: Exists
    tolerationSeconds: 300
  - effect: NoExecute
    key: node.kubernetes.io/unreachable
    operator: Exists
    tolerationSeconds: 300
  volumes:
  - name: kube-api-access-hr782
    projected:
      defaultMode: 420
      sources:
      - serviceAccountToken:
          expirationSeconds: 3607
          path: token
      - configMap:
          items:
          - key: ca.crt
            path: ca.crt
          name: kube-root-ca.crt
      - downwardAPI:
          items:
          - fieldRef:
              apiVersion: v1
              fieldPath: metadata.namespace
            path: namespace
status:
  conditions:
  - lastProbeTime: null
    lastTransitionTime: "2024-09-17T15:46:41Z"
    message: '0/7 nodes are available: 2 node(s) had untolerated taint {CriticalAddonsOnly:
      true}, 5 node(s) had untolerated taint {Vault: true}. preemption: 0/7 nodes
      are available: 7 Preemption is not helpful for scheduling.'
    reason: Unschedulable
    status: "False"
    type: PodScheduled
  phase: Pending
  qosClass: BestEffort
```

After manually edited these two pods, nginx was abbe to bring up

```bash
kubectl edit po ingress-nginx-admission-patch-qfcpq   -n kube-system
pod/ingress-nginx-admission-patch-qfcpq edited

kubectl edit po ingress-nginx-admission-create-g65dk  -n kube-system
pod/ingress-nginx-admission-create-g65dk edited
```

I don't see any possibility to setup toleration's for these resources, please advice.
![image](https://github.com/user-attachments/assets/e2e66c3a-170e-4d7f-8432-0a12b6b69940)
